Revit 2027 API
SolidCurveIntersection.ResultType Property
 The result type used to calculate the intersections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidCurveIntersectionMode ResultType { get; }
Public ReadOnly Property ResultType As SolidCurveIntersectionMode
	Get
public:
property SolidCurveIntersectionMode ResultType {
	SolidCurveIntersectionMode get ();
}
member ResultType : SolidCurveIntersectionMode with get
Property Value
SolidCurveIntersectionMode
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace